# Ultralytics YOLO, AGPL-3.0 license
# RT-DETR-r18 with frequency-aware P2 detail enhancement in the neck.

# Parameters
nc: 80
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4-C2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-C3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-C4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-C5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]] # 10, Y5 P5/32

  - [6, 1, Conv, [256, 1]] # 11, C4 projection P4/16
  - [5, 1, Conv, [256, 1]] # 12, C3 projection P3/8

  - [[11, 10], 1, FreqFusion, []] # 13, frequency-aware P5-P4 fusion
  - [-1, 3, RepC3, [256, 0.5]] # 14
  - [-1, 1, Conv, [256, 1, 1]] # 15, Y4 P4/16

  - [[12, 15], 1, FreqFusion, []] # 16, frequency-aware P4-P3 fusion
  - [-1, 3, RepC3, [256, 0.5]] # 17, base P3/8

  # P2 only supplies shallow detail; it is not sent directly to the decoder.
  - [4, 1, Conv, [128, 1]] # 18, lightweight C2 projection P2/4
  - [17, 1, Conv, [128, 1]] # 19, lightweight P3 guidance branch
  - [[18, 19], 1, FreqFusion, []] # 20, frequency-aware P3-P2 fusion
  - [-1, 1, SPDConv, [128]] # 21, information-preserving P2-to-P3 downsample
  - [[17, 21], 1, MFM, [256]] # 22, single selective P2-P3 fusion
  - [-1, 1, CSPOmniKernel, []] # 23, enhanced P3/8

  # Keep the original FreqFFPN bottom-up PAN path unchanged.
  - [-1, 1, Conv, [256, 3, 2]] # 24, P3-to-P4 downsample
  - [[-1, 15], 1, Concat, [1]] # 25, cat Y4
  - [-1, 3, RepC3, [256, 0.5]] # 26, F4 P4/16

  - [-1, 1, Conv, [256, 3, 2]] # 27, P4-to-P5 downsample
  - [[-1, 10], 1, Concat, [1]] # 28, cat Y5
  - [-1, 3, RepC3, [256, 0.5]] # 29, F5 P5/32

  - [[23, 26, 29], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]] # Detect(P3, P4, P5)
