# Ultralytics YOLO, AGPL-3.0 license
# RT-DETR with SOEP-MFM and a single FreqFusion at the P5-to-P4 top-down fusion.
# The original SOEP P2 -> SPDConv branch and the remaining MFM fusions are unchanged.

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4-P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]] # 10 Y5, P5/32

  # Minimal frequency-aware change: replace only the original P5-upsample/P4 MFM
  # fusion with FreqFusion. The high-resolution P4 feature must be the first input.
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 11 P4/16 projection
  - [[11, 10], 1, FreqFusion, []] # 12 P5 -> P4 frequency-aware fusion
  - [-1, 3, RepC3, [256, 0.5]] # 13 fpn_blocks.0
  - [-1, 1, Conv, [128, 1, 1]] # 14 Y4

  # Original SOEP-MFM small-object branch: keep P2 processing exactly once.
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15 P4 -> P3
  - [4, 1, SPDConv, [128]] # 16 P2 -> P3
  - [[-1, -2, 5], 1, MFM, [256]] # 17 fuse SOEP(P2), top-down P4 and backbone P3
  - [-1, 1, CSPOmniKernel, []] # 18
  - [-1, 3, RepC3, [256, 0.5]] # 19 P3/8

  # Original SOEP-MFM bottom-up path.
  - [-1, 1, Conv, [256, 3, 2]] # 20 P3 -> P4
  - [[-1, 14], 1, MFM, [256]] # 21 fuse Y4
  - [-1, 3, RepC3, [256, 0.5]] # 22 P4/16

  - [-1, 1, Conv, [256, 3, 2]] # 23 P4 -> P5
  - [[-1, 10], 1, MFM, [256]] # 24 fuse Y5
  - [-1, 3, RepC3, [256, 0.5]] # 25 P5/32

  - [[19, 22, 25], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]] # P3, P4, P5
