# Ultralytics YOLO, AGPL-3.0 license
# RT-DETR-r18 with progressive non-gated residual edge transfer from P2 to P3/P4.

# Parameters
nc: 80
pretrained_mapping: rtdetr_r18_geit_progressive_residual
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4-C2/P2
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-C3/P3
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-C4/P4
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-C5/P5

head:
  - [4, 1, ProgressiveEdgePyramid, [[128, 256]]] # 8, P2 -> edge P3/P4
  - [8, 1, GetIndexOutput, [0]] # 9-edge P3/8
  - [8, 1, GetIndexOutput, [1]] # 10-edge P4/16
  - [[9, 5], 1, NormalizedResidualEdgeFusion, [0.10]] # 11-enhanced P3/8
  - [[10, 6], 1, NormalizedResidualEdgeFusion, [0.05]] # 12-enhanced P4/16

  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 13 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 14
  - [-1, 1, Conv, [256, 1, 1]]  # 15, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16
  - [12, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 17 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 18
  - [-1, 3, RepC3, [256, 0.5]]  # 19, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]   # 20, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21
  - [11, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 22 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 23 cat enhanced P3
  - [-1, 3, RepC3, [256, 0.5]]    # X3 (24), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]   # 25, downsample_convs.0
  - [[-1, 20], 1, Concat, [1]]  # 26 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]    # F4 (27), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]   # 28, downsample_convs.1
  - [[-1, 15], 1, Concat, [1]]  # 29 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]    # F5 (30), pan_blocks.1

  - [[24, 27, 30], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
